
// ++ ДЗ_13 07.09.26 (Обработка представления поля КонтактноеЛицо)

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании"); // ваш реквизит

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Представление = Данные.Наименование;
	
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		
		Представление = Представление + " (действует на основании " + Данные.ДействуетНаОсновании + ")";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// -- ДЗ_13 07.09.26 (Обработка представления поля КонтактноеЛицо)